glm-disagg/results/old-qps/1p1d_16/result_qps30.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-disagg
  Decode pod:   ms-glm-disagg-llm-d-modelservice-decode-5549cc586c-ts9t5
  Decode log:   results/1p1d_16//decode_qps30.log
  Prefill pod:  ms-glm-disagg-llm-d-modelservice-prefill-996857c58-ffjkc
  Prefill log:  results/1p1d_16//prefill_qps30.log

Starting decode pod log capture to results/1p1d_16//decode_qps30.log ...
Starting prefill pod log capture to results/1p1d_16//prefill_qps30.log ...

==============================================
Running QPS Sweep via Poker Pod (timeout: 900s)
  Target: glm-disagg | QPS: 30
==============================================

Running: just TARGET_DURATION=30 MIN_PROMPTS=120 sweep-qps glm-disagg 4096 256 30

#!/usr/bin/env bash
URL=$(just _url glm-disagg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-disagg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
SWEEP_QPS_START
CONFIG: target=glm-disagg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=16
TARGET_DURATION: 30s  MIN_PROMPTS: 120
REQUEST_RATE: 30 req/s (Poisson)  NUM_PROMPTS: 900

BENCH_RUN: request_rate=30 num_prompts=900
INFO 02-26 21:04:06 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-26 21:04:06 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-26 21:04:06 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-26 21:04:08 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f526d982d40>, seed=4210403, num_prompts=900, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-disagg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=30.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9d8a8a2e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-26 21:04:10 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/900 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 30.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 900/900 [03:24<00:00,  4.39it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     900       
Failed requests:                         0         
Request rate configured (RPS):           30.00     
Benchmark duration (s):                  204.91    
Total input tokens:                      3685500   
Total generated tokens:                  230400    
Request throughput (req/s):              4.39      
Output token throughput (tok/s):         1124.41   
Peak output token throughput (tok/s):    1199.00   
Peak concurrent requests:                789.00    
Total token throughput (tok/s):          19110.56  
---------------Time to First Token----------------
Mean TTFT (ms):                          86691.38  
Median TTFT (ms):                        86778.86  
P99 TTFT (ms):                           170179.82 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.75     
Median TPOT (ms):                        14.74     
P99 TPOT (ms):                           15.27     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.06     
Median ITL (ms):                         14.45     
P99 ITL (ms):                            40.88     
==================================================
BENCH_RUN_END: request_rate=30

SWEEP_QPS_END

==============================================
Sweep Completed (exit 0)
==============================================

Stopping log captures...
Decode log:  results/1p1d_16//decode_qps30.log (41 lines, 16K)
Prefill log: results/1p1d_16//prefill_qps30.log (922 lines, 148K)